<c><h3><b>Sales Order DB Architecture with ACID-Compliant Business Logic</b></h3></c>

In [2]:
# !pip install ipython-sql pymysql  mysql-connector-python mysqlclient mysql SQLAlchemy

In [3]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:password@localhost:3306/

# Create Database

In [32]:
%%sql
DROP DATABASE IF EXISTS customersDB;
CREATE DATABASE customersDB;

 * mysql+pymysql://root:***@localhost:3306/
11 rows affected.
1 rows affected.

[]

In [33]:
%%sql
USE customersDB;
show tables;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

# Create Tables

In [34]:
%%sql
# customers table dimension table
DROP TABLE IF EXISTS customers;
CREATE TABLE customers(customer_id INT AUTO_INCREMENT,                          #auto
                        first_name VARCHAR(100) NOT NULL,                                   #manual
                        last_name VARCHAR(100) NOT NULL,                                    #manual
                        gender ENUM('male','female','other','prefer not to say') NOT NULL DEFAULT 'prefer not to say',  #manual (trigger for prefer not to say)
                        age INT,                                                            #manual
                        email VARCHAR(100) NOT NULL,                                 #manual
                        ph_num VARCHAR(20) NOT NULL,                                        #manual
                        address VARCHAR(100) NOT NULL,                                     #manual
                        city VARCHAR(50) NOT NULL,                                          #manual
                        state VARCHAR(50) NOT NULL,                                        #manual
                        postal_code VARCHAR(10) NOT NULL,                                   #manual
                        country VARCHAR(100) NOT NULL,                                       #manual
                        registration_date DATETIME(4),                #auto
                        updated_on DATETIME,
                        PRIMARY KEY(customer_id, registration_date)
                        )
PARTITION BY RANGE (YEAR(registration_date))
    (
        PARTITION p_before_2020 VALUES LESS THAN (2021),
        PARTITION p2021 VALUES LESS THAN (2022),
        PARTITION p2022 VALUES LESS THAN (2023),
        PARTITION p2023 VALUES LESS THAN (2024),
        PARTITION p2024 VALUES LESS THAN (2025),
        PARTITION p2025 VALUES LESS THAN (2026),
        PARTITION p_future VALUES LESS THAN MAXVALUE
    );

CREATE INDEX age_index ON customers(age);
CREATE INDEX gender_index ON customers(gender);
CREATE INDEX location_index ON customers(city,state,country);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [35]:
%%sql
# category dim table 
DROP TABLE IF EXISTS category;
CREATE TABLE category(
    category_id INT PRIMARY KEY AUTO_INCREMENT,         #auto
    category_name VARCHAR(50) NOT NULL UNIQUE,          #manual
    description VARCHAR(100) NOT NULL UNIQUE,           #manual
    updated_on DATETIME       #auto/(trigger)
    );

CREATE INDEX id_index ON category(category_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [36]:
%%sql
# products table fact table(contains category table)
DROP TABLE IF EXISTS products;
CREATE TABLE products(
    product_id INT PRIMARY KEY AUTO_INCREMENT,  # automatic
    product_name VARCHAR(50) NOT NULL UNIQUE,          # manual 
    description VARCHAR(100) NOT NULL UNIQUE,          # manual
    category_id INT NOT NULL,                   # manual
    updated_on DATETIME,
    FOREIGN KEY (category_id) REFERENCES category(category_id)
    );

CREATE INDEX id_index ON products(product_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [37]:
%%sql
# inventory fact(1) dimension table
DROP TABLE IF EXISTS inventory;
CREATE TABLE inventory(
    inventory_id INT PRIMARY KEY AUTO_INCREMENT,        #auto
    product_id INT NOT NULL,                            #manual
    quantity INT NOT NULL CHECK (quantity >=0),         #manual
    last_updated DATETIME DEFAULT CURRENT_TIMESTAMP,    #auto/trigger
    FOREIGN KEY (product_id) REFERENCES products(product_id)
    );
CREATE INDEX pid_index ON inventory(product_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [38]:
%%sql
# price table fact(1) table
DROP TABLE IF EXISTS price_history;
CREATE TABLE price_history(
    price_history_id INT PRIMARY KEY AUTO_INCREMENT,                    # automatic
    product_id INT NOT NULL UNIQUE,                             # manual
    price DECIMAL(10,2) NOT NULL CHECK(price>0),                # manual
    effective_date DATE NOT NULL,
    fiscal_year YEAR,
    last_updated DATETIME,            # auto/trigger
    FOREIGN KEY (product_id) REFERENCES products(product_id)
    );

CREATE INDEX id_date_index ON price_history(product_id, fiscal_year, effective_date);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [41]:
%%sql
# orderitems table fact(3) table
DROP TABLE IF EXISTS orderitems;
CREATE TABLE orderitems(
    orderitem_id INT PRIMARY KEY AUTO_INCREMENT,                    #auto
    order_id INT NOT NULL,                                          #manual/create here
    product_id INT NOT NULL,                                        #manual
    customer_id INT NOT NULL,                                       #manual
    seller_id INT NOT NULL,                                         #manual
    quantity INT NOT NULL,                                          #manual
    total_amount INT NOT NULL                                      #trigger data from price table/procedure
    );
CREATE INDEX idx_order ON orderitems(order_id);
CREATE INDEX idx_product_id ON orderitems(product_id);
CREATE INDEX idx_customer_id ON orderitems(customer_id);
CREATE INDEX idx_seller_id ON orderitems(seller_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [42]:
%%sql
# employees table dim
DROP TABLE IF EXISTS employees;
CREATE TABLE employees(
    employee_id INT PRIMARY KEY AUTO_INCREMENT,                     #auto
    first_name VARCHAR(50) NOT NULL,                                #manual
    last_name VARCHAR(50) NOT NULL,                                 #manual
    age INT NOT NULL CHECK(age<=60),                                #manual
    phone_number VARCHAR(16) NOT NULL,                              #manual
    email VARCHAR(50) NOT NULL UNIQUE,                              #manual
    hire_date DATE DEFAULT (CURRENT_DATE),                          #manual
    role VARCHAR(20) NOT NULL,                                      #manual
    termination_date DATE DEFAULT NULL,                             #manual/default null
    manager_id INT,                                                 #manual
    is_working BOOLEAN NOT NULL DEFAULT TRUE,                       #manual/fefault null
    updated_on DATETIME
    );

CREATE INDEX idx_seller_id ON employees(employee_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [43]:
%%sql
# orders table fact(1) table
DROP TABLE IF EXISTS orders;
CREATE TABLE orders(
    order_id INT PRIMARY KEY AUTO_INCREMENT,   #CREATE FROM ORDERITEMS BY procedure unique
    customer_id INT NOT NULL,   #CREATE FROM ORDERITEMS BY procedure unique
    total_quantity INT NOT NULL,     #sum trigger from orderitems
    total_amount INT NOT NULL,  #sum trigger from orderitems
    order_date DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP # auto
)
PARTITION BY HASH(order_id) PARTITIONS 8;

CREATE INDEX idx_customer_id ON orders(customer_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [45]:
%%sql
# shipping table fact(1) table
DROP TABLE IF EXISTS shipping;
CREATE TABLE shipping(
    shipping_id INT PRIMARY KEY AUTO_INCREMENT,   #auto
    order_id INT NOT NULL,                              #procedure
    shipping_date DATE NULL,                            #manual
    shipping_status ENUM('shipped', 'pending', 'delivered','cancelled') DEFAULT 'pending',#manual
    delivery_date DATE,                                     #MANUAL
    shipping_addresss VARCHAR(200) NOT NULL,                #manual or can be populate from customers table if same address
    city VARCHAR(50) NOT NULL,                              #manual
    state VARCHAR(50) NOT NULL,                             #manual
    postalcode VARCHAR(10) NOT NULL,                        #manual
    country VARCHAR(50) NOT NULL
    );
CREATE INDEX idx_ordres ON shipping(order_id);
CREATE INDEX idx_delivery ON shipping(delivery_date);
CREATE INDEX idx_status ON shipping(shipping_status);
CREATE INDEX idx_shipping_date ON shipping(shipping_date);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [51]:
%%sql
# log table (audit table)
DROP TABLE IF EXISTS audit;
CREATE TABLE audit(
    audit_id INT PRIMARY KEY AUTO_INCREMENT,
    table_name VARCHAR(20) NOT NULL,
    new_value JSON,
    old_value JSON,
    action ENUM('insert','update','delete') NOT NULL,
    user_id VARCHAR(50) NOT NULL,
    time DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP
    );
CREATE INDEX idx_action ON audit(action);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [52]:
%%sql
DROP TABLE IF EXISTS cart;
CREATE TABLE cart(
    product_id INT NOT NULL,
    customer_id INT NOT NULL,
    seller_id INT NOT NULL,
    quantity INT NOT NULL,
    total_amount INT NOT NULL,
    done BOOLEAN NOT NULL DEFAULT 0,
    FOREIGN KEY(seller_id) REFERENCES employees(employee_id),
    FOREIGN KEY(product_id) REFERENCES products(product_id)
);
CREATE INDEX idx_customers ON cart(customer_id);
CREATE INDEX idx_products ON cart(product_id);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [53]:
%%sql
USE customersdb;
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
11 rows affected.

[('audit',),
 ('cart',),
 ('category',),
 ('customers',),
 ('employees',),
 ('inventory',),
 ('orderitems',),
 ('orders',),
 ('price_history',),
 ('products',),
 ('shipping',)]

# Triggers

In [54]:
%%sql
DROP TRIGGER IF EXISTS insert_customer_table;
CREATE TRIGGER insert_customer_table
BEFORE INSERT ON customers
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,new_value,action,user_id)
    VALUES ('customers',
        JSON_OBJECT(
            'ID',NEW.customer_id, 
            'name',CONCAT(NEW.first_name,' ',NEW.last_name),
            'gender',NEW.gender,
            'ph_num',NEW.ph_num,
            'address', NEW.address,
            'city',NEW.city,
            'postal_code',NEW.postal_code,
            'country',NEW.country),
            'insert',CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [55]:
%%sql
DROP TRIGGER IF EXISTS update_customer_table;
CREATE TRIGGER update_customer_table
BEFORE UPDATE ON customers
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,old_value,new_value,action,user_id)
    VALUES ('customers',
        JSON_OBJECT(
            'ID',OLD.customer_id, 
            'name',CONCAT(OLD.first_name,' ',OLD.last_name),
            'gender',OLD.gender,
            'ph_num',OLD.ph_num,
            'address', OLD.address,
            'city',OLD.city,
            'postal_code',OLD.postal_code,
            'country',OLD.country) ,
        JSON_OBJECT(
            'ID',NEW.customer_id, 
            'name',CONCAT(NEW.first_name,' ',NEW.last_name),
            'gender',NEW.gender,
            'ph_num',NEW.ph_num,
            'address', NEW.address,
            'city',NEW.city,
            'postal_code',NEW.postal_code,
            'country',NEW.country),
            'update',CURRENT_USER());

END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [56]:
%%sql
DROP TRIGGER IF EXISTS delete_customer_table;
CREATE TRIGGER delete_customer_table
BEFORE DELETE ON customers
FOR EACH ROW
BEGIN
    INSERT INTO audit(table_name,old_value,action,user_id)
    VALUES ('customers',
        JSON_OBJECT(
            'ID',OLD.customer_id, 
            'name',CONCAT(OLD.first_name,' ',OLD.last_name),
            'gender',OLD.gender,
            'ph_num',OLD.ph_num,
            'address', OLD.address,
            'city',OLD.city,
            'postal_code',OLD.postal_code,
            'country',OLD.country) ,
            'delete',CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [57]:
%%sql
DROP TRIGGER IF EXISTS insert_on_category_table;
CREATE TRIGGER insert_on_category_table
BEFORE INSERT ON category
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,new_value,action,user_id)
    VALUES ('category',
            JSON_OBJECT(
                'id',NEW.category_id,
                'name',NEW.category_name,
                'desc',NEW.description
            ),
            'insert',
            CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [58]:
%%sql
DROP TRIGGER IF EXISTS update_date_on_category_table;
CREATE TRIGGER update_date_on_category_table
BEFORE UPDATE ON category
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,old_value,new_value,action,user_id)
    VALUES ('category',
            JSON_OBJECT(
                'id',OLD.category_id,
                'name',OLD.category_name,
                'desc',OLD.description
            ),
            JSON_OBJECT(
                'id',NEW.category_id,
                'name',NEW.category_name,
                'desc',NEW.description
            ),
            'update',
            CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [59]:
%%sql
DROP TRIGGER IF EXISTS delete_on_category_table;
CREATE TRIGGER delete_on_category_table
BEFORE DELETE ON category
FOR EACH ROW
BEGIN
    INSERT INTO audit(table_name,old_value,action,user_id)
    VALUES ('category',
            JSON_OBJECT(
                'id',OLD.category_id,
                'name',OLD.category_name,
                'desc',OLD.description
            ),
            'delete',
            CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [60]:
%%sql
DROP TRIGGER IF EXISTS insert_on_product_table;
CREATE TRIGGER insert_on_product_table
BEFORE insert ON products
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,new_value,action,user_id)
    VALUES ('products',
            JSON_OBJECT(
                'id',NEW.product_id,
                'name',NEW.product_name,
                'description',NEW.description,
                'category_id',NEW.category_id
            ),
            'insert',
            CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [61]:
%%sql
DROP TRIGGER IF EXISTS update_on_product_table;
CREATE TRIGGER update_on_product_table
BEFORE UPDATE ON products
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,old_value,new_value,action,user_id)
    VALUES ('products',
            JSON_OBJECT(
                'id',OLD.product_id,
                'name',OLD.product_name,
                'description',OLD.description,
                'category_id',OLD.category_id
            ),
            JSON_OBJECT(
                'id',NEW.product_id,
                'name',NEW.product_name,
                'description',NEW.description,
                'category_id',NEW.category_id
            ),
            'update',
            CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [62]:
%%sql
DROP TRIGGER IF EXISTS delete_on_product_table;
CREATE TRIGGER delete_on_product_table
BEFORE DELETE ON products
FOR EACH ROW
BEGIN

    INSERT INTO audit(table_name,old_value,action,user_id)
    VALUES ('products',
            JSON_OBJECT(
                'id',OLD.product_id,
                'name',OLD.product_name,
                'description',OLD.description,
                'category_id',OLD.category_id
            ),
            'delete',
            CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [63]:
%%sql
DROP TRIGGER IF EXISTS update_date_on_inventory_table;
CREATE TRIGGER insert_on_inventory_table
BEFORE INSERT ON inventory
FOR EACH ROW
BEGIN

    SET NEW.last_updated = NOW();

    INSERT INTO audit(table_name,new_value,action,user_id)
    VALUES ('inventory',
            JSON_OBJECT(
                'product_id',NEW.product_id,
                'quantity',NEW.quantity),
            'insert',CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [64]:
%%sql
DROP TRIGGER IF EXISTS update_date_on_inventory_table;
CREATE TRIGGER update_date_on_inventory_table
BEFORE UPDATE ON inventory
FOR EACH ROW
BEGIN

    SET NEW.last_updated = NOW();

    INSERT INTO audit(table_name,old_value,new_value,action,user_id)
    VALUES ('inventory',
            JSON_OBJECT(
                'product_id',OLD.product_id,
                'quantity',OLD.quantity),
            JSON_OBJECT(
                'product_id',NEW.product_id,
                'quantity',NEW.quantity),
            'update',CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [65]:
%%sql
DROP TRIGGER IF EXISTS update_date_on_inventory_table;
CREATE TRIGGER update_date_on_inventory_table
BEFORE UPDATE ON inventory
FOR EACH ROW
BEGIN
    INSERT INTO audit(table_name,old_value,action,user_id)
    VALUES ('inventory',
            JSON_OBJECT(
                'product_id',NEW.product_id,
                'quantity',NEW.quantity),
            'delete',CURRENT_USER());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [66]:
%%sql
DROP TRIGGER IF EXISTS insert_on_price_table;
CREATE TRIGGER insert_on_price_table
BEFORE INSERT ON price_history
FOR EACH ROW
BEGIN

    SET NEW.last_updated = NOW();

    INSERT INTO audit(table_name,new_value,action,user_id)
    VALUES ('price_history',
        JSON_OBJECT(
            'product',NEW.product_id,
            'price',NEW.price,
            'effective_date',NEW.effective_date
        ),
        'insert',CURRENT_USER());
END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [67]:
%%sql
DROP TRIGGER IF EXISTS price_update_on_price_table;
CREATE TRIGGER price_update_on_price_table
BEFORE UPDATE ON price_history
FOR EACH ROW
BEGIN

    SET NEW.last_updated = NOW();

    INSERT INTO audit(table_name,old_value,new_value,action,user_id)
    VALUES ('price_history',
        JSON_OBJECT(
            'product',OLD.product_id,
            'price',OLD.price,
            'effective_date',OLD.effective_date
        ),
        JSON_OBJECT(
            'product',NEW.product_id,
            'price',NEW.price,
            'effective_date',NEW.effective_date
        ),
        'update',CURRENT_USER());
END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [68]:
%%sql
DROP TRIGGER IF EXISTS delete_on_price_table;
CREATE TRIGGER delete_on_price_table
BEFORE DELETE ON price_history
FOR EACH ROW
BEGIN

    INSERT INTO audit(table_name,old_value,action,user_id)
    VALUES ('price_history',
        JSON_OBJECT(
            'product',OLD.product_id,
            'price',OLD.price,
            'effective_date',OLD.effective_date
        ),
        'delete',CURRENT_USER());
END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [69]:
%%sql
DROP TRIGGER IF EXISTS insert_employee_table;
CREATE TRIGGER insert_employee_table
BEFORE INSERT ON employees
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,new_value,action,user_id)
    VALUES ('employees',
        JSON_OBJECT(
            'id',NEW.employee_id,
            'name',CONCAT(NEW.first_name," ", NEW.last_name),
            'age',NEW.age,
            'phone_number',NEW.phone_number,
            'email',NEW.email,
            'role',NEW.role,
            'termination_date',NEW.termination_date,
            'manager_id',NEW.manager_id,
            'is_working',NEW.is_working
        ),
        'insert',CURRENT_USER());

END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [70]:
%%sql
DROP TRIGGER IF EXISTS update_on_employee_table;
CREATE TRIGGER update_on_employee_table
BEFORE UPDATE ON employees
FOR EACH ROW
BEGIN

    SET NEW.updated_on = NOW();

    INSERT INTO audit(table_name,old_value,new_value,action,user_id)
    VALUES ('employees',
        JSON_OBJECT(
            'id',OLD.employee_id,
            'name',CONCAT(OLD.first_name," ", OLD.last_name),
            'age',OLD.age,
            'phone_number',OLD.phone_number,
            'email',OLD.email,
            'role',OLD.role,
            'termination_date',OLD.termination_date,
            'manager_id',OLD.manager_id,
            'is_working',OLD.is_working
        ),
        JSON_OBJECT(
            'id',NEW.employee_id,
            'name',CONCAT(NEW.first_name," ", NEW.last_name),
            'age',NEW.age,
            'phone_number',NEW.phone_number,
            'email',NEW.email,
            'role',NEW.role,
            'termination_date',NEW.termination_date,
            'manager_id',NEW.manager_id,
            'is_working',NEW.is_working
        ),
        'update',CURRENT_USER());

END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [71]:
%%sql
DROP TRIGGER IF EXISTS delete_employee_table;
CREATE TRIGGER delete_employee_table
BEFORE DELETE ON employees
FOR EACH ROW
BEGIN

    INSERT INTO audit(table_name,old_value,action,user_id)
    VALUES ('employees',
        JSON_OBJECT(
            'id',OLD.employee_id,
            'name',CONCAT(OLD.first_name," ", OLD.last_name),
            'age',OLD.age,
            'phone_number',OLD.phone_number,
            'email',OLD.email,
            'role',OLD.role,
            'termination_date',OLD.termination_date,
            'manager_id',OLD.manager_id,
            'is_working',OLD.is_working
        ),
        'delete',CURRENT_USER());

END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

# Procedure

In [72]:
%%sql
DROP PROCEDURE IF EXISTS update_manager_employees;
CREATE PROCEDURE update_manager_employees(
    IN e_id INT,
    IN m_id INT)
BEGIN
    UPDATE employees
    SET manager_id = m_id
    WHERE employee_id = e_id;
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [73]:
%%sql
DROP PROCEDURE IF EXISTS update_termination_employees;
CREATE PROCEDURE update_termination_employees(
    IN e_id INT
)
BEGIN
    UPDATE employees
    SET termination_date = CURRDATE(), is_working = 0
    WHERE employee_id = e_id;
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

# Insert procedure

In [74]:
%%sql
DROP PROCEDURE IF EXISTS insert_date_in_customers;
CREATE PROCEDURE insert_date_in_customers(
    IN p_fname VARCHAR(100), 
    IN p_lname VARCHAR(100),
    IN p_gen VARCHAR(10),
    IN p_age INT,
    IN p_email VARCHAR(100),
    IN p_phone VARCHAR(20),
    IN p_addr VARCHAR(100),
    IN p_city VARCHAR(50),
    IN p_state VARCHAR(50),
    IN p_post VARCHAR(10),
    IN p_country VARCHAR(50)
    )
BEGIN
    DECLARE p_mail BOOLEAN DEFAULT FALSE;
    DECLARE p_ph BOOLEAN DEFAULT FALSE;

    IF EXISTS (SELECT 1 FROM customers WHERE email = p_email) THEN
        SET p_mail = TRUE;
    END IF; 

    IF EXISTS (SELECT 1 FROM customers WHERE ph_num = p_phone) THEN
            SET p_ph = TRUE;
    END IF; 

    IF p_mail AND p_ph THEN 
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'This Email and Phone number already Registered. Please Use Different Email and Phone number.';
    ELSEIF p_mail THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'This Email-ID already Registered. Please Use Different Email-ID.';
    ELSEIF p_ph THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'This phone number already Registered. Please Use Different Phone number.';
    END IF;

    IF p_age <=0 THEN
        SET p_age = NULL;
    END IF;

    IF p_gen IS NULL THEN
        SET p_gen = 'prefer not to say';
    END IF;

    INSERT INTO customers (first_name,last_name,gender,age,email,ph_num,
    address,city,state,postal_code,country,registration_date)
    VALUES
    (p_fname,p_lname,p_gen,p_age,p_email,p_phone,p_addr,p_city,p_state,p_post,p_country,NOW(4));

END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [75]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_category;
CREATE PROCEDURE insert_values_category(IN name VARCHAR(50),
                                        IN des VARCHAR(100))
BEGIN
    INSERT INTO category(category_name, description,updated_on)
    VALUES (name,des,NOW());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [76]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_products;
CREATE PROCEDURE insert_values_products(
    IN name VARCHAR(50),
    IN des VARCHAR(100),
    IN cat INT
)
BEGIN 
    INSERT INTO products(product_name,description,category_id,updated_on)
    VALUES (name,des,cat,NOW());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [77]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_inventory;
CREATE PROCEDURE insert_values_inventory(
    IN pid INT,
    IN qty INT)
BEGIN
    INSERT INTO inventory(product_id,quantity,last_updated)
    VALUES (pid,qty,NOW());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [78]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_price;
CREATE PROCEDURE insert_values_price(
    IN pid INT,
    IN price INT,
    IN start_at DATE)
BEGIN
    DECLARE yr YEAR DEFAULT YEAR(CURDATE());

    INSERT INTO price_history(product_id,price,fiscal_year,effective_date,last_updated)
    VALUES (pid,price,yr,start_at,NOW());

END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [79]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_cart;
CREATE PROCEDURE insert_values_cart(
    IN pid INT,
    IN cid INT,
    IN sid INT,
    IN qty INT,
    IN done INT)
BEGIN
    DECLARE price_value INT;
    DECLARE oid INT;
    DECLARE tqty INT;
    DECLARE tamt INT;
    DECLARE piqty INT;
    DECLARE pcqty INT DEFAULT 0;

    DECLARE c_pid INT;
    DECLARE c_qty INT;
    DECLARE c_done BOOLEAN DEFAULT 0;
    DECLARE done_flag INT DEFAULT 0; -- A flag to signal when to exit the loop
    DECLARE inventory_cursor CURSOR FOR 
                                    SELECT product_id, SUM(quantity) 
                                    FROM cart 
                                    WHERE customer_id = cid
                                    GROUP BY product_id 
                                    ORDER BY done ASC;
    
    DECLARE CONTINUE HANDLER FOR NOT FOUND SET done_flag = 1;

    -- Start the transaction
    START TRANSACTION;

    -- Fetch the price of the product
    SELECT COALESCE(MAX(price), 0) INTO price_value 
    FROM price_history
    WHERE product_id = pid 
    AND effective_date <= CURDATE()
    ORDER BY effective_date DESC 
    LIMIT 1;

    -- Fetch the available quantity in inventory
    SELECT COALESCE(SUM(quantity), 0) INTO piqty 
    FROM inventory 
    WHERE product_id = pid;

    -- Check for existing cart entry and adjust the quantity if needed
    IF EXISTS (SELECT 1 FROM cart WHERE product_id = pid AND customer_id = cid AND seller_id = sid) THEN
        SELECT quantity INTO pcqty FROM cart WHERE product_id = pid AND customer_id = cid AND seller_id = sid;
    END IF;

    SET qty = qty + pcqty;

    -- Check if there is enough inventory and price is valid
    IF piqty >= qty AND price_value > 0 AND piqty > 0 THEN
        IF pcqty > 0 THEN
            UPDATE cart 
            SET quantity = qty 
            WHERE product_id = pid 
            AND customer_id = cid 
            AND seller_id = sid;
        ELSE        
            INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
            VALUES (pid, cid, sid, qty, qty * price_value, done);
        END IF;
    ELSE 
        ROLLBACK;
        SIGNAL SQLSTATE '45000' 
        SET MESSAGE_TEXT = 'Quantity cannot be less than inventory value';
    END IF;

    -- Proceed with creating orders if the cart is done
    IF EXISTS (SELECT 1 FROM cart WHERE customer_id = cid AND done = 1) THEN
        OPEN inventory_cursor;

        -- REPEAT UNTIL loop to process each row fetched by the cursor
        REPEAT
            FETCH inventory_cursor INTO c_pid, c_qty;
            IF NOT done_flag THEN
                -- Update inventory based on the quantity fetched from the cart
                UPDATE inventory 
                SET quantity = (quantity - c_qty),last_updated = NOW()
                WHERE product_id = c_pid;
            END IF;
        UNTIL done_flag END REPEAT;

        CLOSE inventory_cursor;

        -- Insert the order record
        INSERT INTO orders(customer_id, total_quantity, total_amount)
        SELECT customer_id, SUM(quantity), SUM(total_amount) 
        FROM cart 
        WHERE customer_id = cid 
        GROUP BY customer_id;

        -- Fetch the most recent order ID
        SELECT order_id INTO oid 
        FROM orders 
        WHERE customer_id = cid 
        ORDER BY order_date DESC 
        LIMIT 1;

        -- Insert the order items
        INSERT INTO orderitems(order_id, product_id, customer_id, seller_id, quantity, total_amount)
        SELECT oid, product_id, customer_id, seller_id, quantity, total_amount 
        FROM cart 
        WHERE customer_id = cid;

        -- Clear the cart after order is created
        DELETE FROM cart WHERE customer_id = cid;

    END IF;

    -- Commit the transaction
    COMMIT;
END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [80]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_employees;
CREATE PROCEDURE insert_values_employees(
    IN fname VARCHAR(50),
    IN lname VARCHAR(50),
    IN age INT,
    IN ph VARCHAR(16),
    IN email VARCHAR(50),
    IN role VARCHAR(20)
)
BEGIN
    INSERT INTO employees(first_name, last_name, age, phone_number, email, role,updated_on)
    VALUES (fname,lname,age,ph,email,role,NOW());
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [81]:
%%sql
DROP PROCEDURE IF EXISTS copy_shipping_address;
CREATE PROCEDURE copy_shipping_address(
    IN cid INT,
    IN oid INT
)

BEGIN
    INSERT INTO shipping(order_id, shipping_addresss, city, state, postalcode, country) (SELECT oid,address,city,state,postal_code,country 
                          FROM customers WHERE customer_id = cid);
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [82]:
%%sql
DROP PROCEDURE IF EXISTS shipping_address;
CREATE PROCEDURE shipping_address(
    IN oid INT,
    IN address VARCHAR(200),
    IN p_city VARCHAR(50),
    IN p_state VARCHAR(50),
    IN p_postal VARCHAR(10),
    IN p_country VARCHAR(50)
)
BEGIN
    INSERT INTO shipping(order_id,shipping_address,city,state,postalcode,country)
    VALUES (oid,address,p_city,p_state,p_postal,p_country);
END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [83]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

In [84]:
%%sql
call copy_shipping_address(1,1);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [85]:
%sql

 * mysql+pymysql://root:***@localhost:3306/

In [86]:
%sql

 * mysql+pymysql://root:***@localhost:3306/

In [87]:
%sql

 * mysql+pymysql://root:***@localhost:3306/

In [88]:
%%sql
# truncate customers;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [49]:
%%sql
use customersdb;
INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Riya', 'Chatterjee', 'female', 29, 'riya.chat29@example.com', '9812345001', '32 Lake Road', 'Kolkata', 'West Bengal', '700029', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Sahil', 'Malhotra', 'male', 35, 'sahil.malhotra35@example.com', '9911122233', '7 Block D, Punjabi Bagh', 'Delhi', 'Delhi', '110026', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Kavya', 'Reddy', 'female', 31, 'kavya.reddy31@example.com', '9845123401', '98 Road No. 10', 'Hyderabad', 'Telangana', '500034', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Aditya', 'Verma', 'male', 27, 'aditya.verma27@example.com', '9898989898', '221 Rajiv Nagar', 'Patna', 'Bihar', '800001', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Neha', 'Desai', 'female', 40, 'neha.desai40@example.com', '9822054321', '66 Shivaji Park', 'Mumbai', 'Maharashtra', '400028', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Manoj', 'Kumar', 'male', 33, 'manoj.kumar33@example.com', '9830012345', '45 Vivekananda Street', 'Kolkata', 'West Bengal', '700019', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Tanvi', 'Nair', 'female', 26, 'tanvi.nair26@example.com', '9998800001', '12 MG Layout', 'Chennai', 'Tamil Nadu', '600028', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Arvind', 'Gupta', 'male', 38, 'arvind.gupta38@example.com', '9810001234', '9 City Centre', 'Ahmedabad', 'Gujarat', '380015', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Nikita', 'Sharma', 'female', 30, 'nikita.sharma30@example.com', '9876543210', '78 Model Town', 'Jalandhar', 'Punjab', '144003', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Vikram', 'Singh', 'male', 45, 'vikram.singh45@example.com', '9988776655', '50 MI Road', 'Jaipur', 'Rajasthan', '302001', 'India', NOW(4));

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [52]:
%%sql
CALL insert_date_in_customers(
    'Neha', 'Saxena', 'female', 28, 'neha.saxena10@example.com', '9991000010',
    '2 Boring Road', 'Patna', 'Bihar', '800001', 'India');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[]

In [53]:
%%sql
CALL insert_date_in_customers(
    'Varun', 'Malik', 'male', 36, 'varun.malik0009@example.com', '9993008229',
    '10 Sector 12', 'Gurgaon', 'Haryana', '122001', 'India');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[]

In [54]:
%%sql
SELECT * FROM CUSTOMERS;

 * mysql+pymysql://root:***@localhost:3306/
12 rows affected.

[(1, 'Riya', 'Chatterjee', 'female', 29, 'riya.chat29@example.com', '9812345001', '32 Lake Road', 'Kolkata', 'West Bengal', '700029', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 220500), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (2, 'Sahil', 'Malhotra', 'male', 35, 'sahil.malhotra35@example.com', '9911122233', '7 Block D, Punjabi Bagh', 'Delhi', 'Delhi', '110026', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 263000), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (3, 'Kavya', 'Reddy', 'female', 31, 'kavya.reddy31@example.com', '9845123401', '98 Road No. 10', 'Hyderabad', 'Telangana', '500034', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 267600), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (4, 'Aditya', 'Verma', 'male', 27, 'aditya.verma27@example.com', '9898989898', '221 Rajiv Nagar', 'Patna', 'Bihar', '800001', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 271800), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (5, 'Neha', 'Desai', 'female', 40, 'neha.desai40@example.com', '9822054321', '66 Shivaji Park', 'Mumbai', 'Maharashtra', '400028', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 278900), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (6, 'Manoj', 'Kumar', 'male', 33, 'manoj.kumar33@example.com', '9830012345', '45 Vivekananda Street', 'Kolkata', 'West Bengal', '700019', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 291400), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (7, 'Tanvi', 'Nair', 'female', 26, 'tanvi.nair26@example.com', '9998800001', '12 MG Layout', 'Chennai', 'Tamil Nadu', '600028', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 298400), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (8, 'Arvind', 'Gupta', 'male', 38, 'arvind.gupta38@example.com', '9810001234', '9 City Centre', 'Ahmedabad', 'Gujarat', '380015', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 304300), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (9, 'Nikita', 'Sharma', 'female', 30, 'nikita.sharma30@example.com', '9876543210', '78 Model Town', 'Jalandhar', 'Punjab', '144003', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 309700), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (10, 'Vikram', 'Singh', 'male', 45, 'vikram.singh45@example.com', '9988776655', '50 MI Road', 'Jaipur', 'Rajasthan', '302001', 'India', datetime.datetime(2025, 8, 7, 15, 8, 25, 313600), datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (12, 'Neha', 'Saxena', 'female', 28, 'neha.saxena10@example.com', '9991000010', '2 Boring Road', 'Patna', 'Bihar', '800001', 'India', datetime.datetime(2025, 8, 7, 15, 10, 33, 104200), datetime.datetime(2025, 8, 7, 15, 10, 33)),
 (13, 'Varun', 'Malik', 'male', 36, 'varun.malik0009@example.com', '9993008229', '10 Sector 12', 'Gurgaon', 'Haryana', '122001', 'India', datetime.datetime(2025, 8, 7, 15, 10, 37, 210100), datetime.datetime(2025, 8, 7, 15, 10, 37))]

In [55]:
%%sql
-- Normal Insert: Insert a category directly
INSERT INTO category(category_name, description)
VALUES ('Electronics', 'Devices and gadgets like phones, laptops, etc.');

INSERT INTO category(category_name, description)
VALUES ('Clothing', 'Apparel and fashion items such as shirts, pants, etc.');

INSERT INTO category(category_name, description)
VALUES ('Groceries', 'Food items, vegetables, fruits, etc.');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [56]:
%%sql
-- Insert categories using the stored procedure
CALL insert_values_category('Toys', 'Playthings for children, games, and puzzles.');
CALL insert_values_category('Furniture', 'Chairs, tables, beds, and other furniture items.');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [57]:
%%sql
SELECT * FROM CATEGORY;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 'Electronics', 'Devices and gadgets like phones, laptops, etc.', datetime.datetime(2025, 8, 7, 15, 10, 51)),
 (2, 'Clothing', 'Apparel and fashion items such as shirts, pants, etc.', datetime.datetime(2025, 8, 7, 15, 10, 51)),
 (3, 'Groceries', 'Food items, vegetables, fruits, etc.', datetime.datetime(2025, 8, 7, 15, 10, 51)),
 (4, 'Toys', 'Playthings for children, games, and puzzles.', datetime.datetime(2025, 8, 7, 15, 10, 53)),
 (5, 'Furniture', 'Chairs, tables, beds, and other furniture items.', datetime.datetime(2025, 8, 7, 15, 10, 53))]

In [58]:
%%sql
-- Insert products directly into the products table

-- Product: Smartphone in Electronics category (category_id = 1)
INSERT INTO products(product_name, description, category_id)
VALUES ('Smartphone', 'Latest model smartphone with advanced features', 1);

-- Product: T-shirt in Clothing category (category_id = 2)
INSERT INTO products(product_name, description, category_id)
VALUES ('T-shirt', 'Cotton t-shirt with modern design', 2);

-- Product: Apple in Groceries category (category_id = 3)
INSERT INTO products(product_name, description, category_id)
VALUES ('Apple', 'Fresh red apples, locally grown', 3);

-- Product: Laptop in Electronics category (category_id = 1)
INSERT INTO products(product_name, description, category_id)
VALUES ('Laptop', 'High-performance laptop for gaming and work', 1);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [59]:
%%sql

-- Product: Jeans in Clothing category (category_id = 2)
INSERT INTO products(product_name, description, category_id)
VALUES ('Jeans', 'Blue denim jeans, slim fit', 2);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[]

In [60]:
%%sql
select * from products;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 'Smartphone', 'Latest model smartphone with advanced features', 1, datetime.datetime(2025, 8, 7, 15, 11)),
 (2, 'T-shirt', 'Cotton t-shirt with modern design', 2, datetime.datetime(2025, 8, 7, 15, 11)),
 (3, 'Apple', 'Fresh red apples, locally grown', 3, datetime.datetime(2025, 8, 7, 15, 11)),
 (4, 'Laptop', 'High-performance laptop for gaming and work', 1, datetime.datetime(2025, 8, 7, 15, 11)),
 (5, 'Jeans', 'Blue denim jeans, slim fit', 2, datetime.datetime(2025, 8, 7, 15, 11, 2))]

In [61]:
%%sql
-- Insert inventory data directly into the inventory table

-- Inventory for Smartphone (product_id = 1)
INSERT INTO inventory(product_id, quantity)
VALUES (1, 100);

-- Inventory for T-shirt (product_id = 2)
INSERT INTO inventory(product_id, quantity)
VALUES (2, 200);

-- Inventory for Apple (product_id = 3)
INSERT INTO inventory(product_id, quantity)
VALUES (3, 500);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [62]:
%%sql
-- Call the procedure to insert inventory data


-- Insert inventory for Laptop (product_id = 4, quantity = 50)
CALL insert_values_inventory(4, 50);

-- Insert inventory for Jeans (product_id = 5, quantity = 150)
CALL insert_values_inventory(5, 150);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [63]:
%%sql
SELECT * FROM inventory;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 1, 100, datetime.datetime(2025, 8, 7, 15, 11, 7)),
 (2, 2, 200, datetime.datetime(2025, 8, 7, 15, 11, 7)),
 (3, 3, 500, datetime.datetime(2025, 8, 7, 15, 11, 7)),
 (4, 4, 50, datetime.datetime(2025, 8, 7, 15, 11, 12)),
 (5, 5, 150, datetime.datetime(2025, 8, 7, 15, 11, 12))]

In [64]:
%%sql
-- Insert price history data directly into the price_history table

-- Price for Smartphone (product_id = 1)
INSERT INTO price_history(product_id, price, fiscal_year, effective_date)
VALUES (1, 599.99, YEAR(CURDATE()), '2025-01-01');

-- Price for T-shirt (product_id = 2)
INSERT INTO price_history(product_id, price, fiscal_year, effective_date)
VALUES (2, 19.99, YEAR(CURDATE()), '2025-02-01');

-- Price for Apple (product_id = 3)
INSERT INTO price_history(product_id, price, fiscal_year, effective_date)
VALUES (3, 1.99, YEAR(CURDATE()), '2025-03-01');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [65]:
%%sql
-- Call the procedure to insert price history data

# -- Insert price for Smartphone (product_id = 1, price = 599.99, effective_date = '2025-01-01')
# CALL insert_values_price(1, 599.99, '2025-01-01');

# -- Insert price for T-shirt (product_id = 2, price = 19.99, effective_date = '2025-02-01')
# CALL insert_values_price(2, 19.99, '2025-02-01');

# -- Insert price for Apple (product_id = 3, price = 1.99, effective_date = '2025-03-01')
# CALL insert_values_price(3, 1.99, '2025-03-01');

-- Insert price for Laptop (product_id = 4, price = 1299.99, effective_date = '2025-01-15')
CALL insert_values_price(4, 1299.99, '2025-01-15');

-- Insert price for Jeans (product_id = 5, price = 39.99, effective_date = '2025-02-15')
CALL insert_values_price(5, 39.99, '2025-02-15');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [67]:
%%sql
SELECT * FROM price_history;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 1, Decimal('599.99'), datetime.date(2025, 1, 1), 2025, datetime.datetime(2025, 8, 7, 15, 11, 41)),
 (2, 2, Decimal('19.99'), datetime.date(2025, 2, 1), 2025, datetime.datetime(2025, 8, 7, 15, 11, 41)),
 (3, 3, Decimal('1.99'), datetime.date(2025, 3, 1), 2025, datetime.datetime(2025, 8, 7, 15, 11, 41)),
 (4, 4, Decimal('1300.00'), datetime.date(2025, 1, 15), 2025, datetime.datetime(2025, 8, 7, 15, 11, 42)),
 (5, 5, Decimal('40.00'), datetime.date(2025, 2, 15), 2025, datetime.datetime(2025, 8, 7, 15, 11, 42))]

In [68]:
%%sql
-- Insert employees directly into the employees table

-- Employee 1: John Doe (Manager)
INSERT INTO employees(first_name, last_name, age, phone_number, email, role)
VALUES ('John', 'Doe', 45, '123-456-7890', 'john.doe@example.com', 'Manager');

-- Employee 2: Alice Smith (Team Member under John)
INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
VALUES ('Alice', 'Smith', 30, '987-654-3210', 'alice.smith@example.com', 'Team Member', 1);

-- Employee 3: Bob Johnson (Team Member under John)
INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
VALUES ('Bob', 'Johnson', 35, '555-123-4567', 'bob.johnson@example.com', 'Team Member', 1);

# -- Employee 4: Sarah White (Team Member under Alice)
# INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
# VALUES ('Sarah', 'White', 28, '444-987-6543', 'sarah.white@example.com', 'Team Member', 2);

# -- Employee 5: Tom Brown (Team Member under Bob)
# INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
# VALUES ('Tom', 'Brown', 32, '333-555-7777', 'tom.brown@example.com', 'Team Member', 3);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [69]:
%%sql
-- Call the procedure to insert employees

# -- Insert Employee 1: John Doe (Manager)
# CALL insert_values_employees('John', 'Doe', 45, '123-456-7890', 'john.doe@example.com', 'Manager');

# -- Insert Employee 2: Alice Smith (Team Member under John)
# CALL insert_values_employees('Alice', 'Smith', 30, '987-654-3210', 'alice.smith@example.com', 'Team Member');

# -- Insert Employee 3: Bob Johnson (Team Member under John)
# CALL insert_values_employees('Bob', 'Johnson', 35, '555-123-4567', 'bob.johnson@example.com', 'Team Member');

-- Insert Employee 4: Sarah White (Team Member under Alice)
CALL insert_values_employees('Sarah', 'White', 28, '444-987-6543', 'sarah.white@example.com', 'Team Member');

-- Insert Employee 5: Tom Brown (Team Member under Bob)
CALL insert_values_employees('Tom', 'Brown', 32, '333-555-7777', 'tom.brown@example.com', 'Team Member');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [70]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 'John', 'Doe', 45, '123-456-7890', 'john.doe@example.com', datetime.date(2025, 8, 7), 'Manager', None, None, 1, datetime.datetime(2025, 8, 7, 15, 12, 24)),
 (2, 'Alice', 'Smith', 30, '987-654-3210', 'alice.smith@example.com', datetime.date(2025, 8, 7), 'Team Member', None, 1, 1, datetime.datetime(2025, 8, 7, 15, 12, 24)),
 (3, 'Bob', 'Johnson', 35, '555-123-4567', 'bob.johnson@example.com', datetime.date(2025, 8, 7), 'Team Member', None, 1, 1, datetime.datetime(2025, 8, 7, 15, 12, 24)),
 (4, 'Sarah', 'White', 28, '444-987-6543', 'sarah.white@example.com', datetime.date(2025, 8, 7), 'Team Member', None, None, 1, datetime.datetime(2025, 8, 7, 15, 12, 25)),
 (5, 'Tom', 'Brown', 32, '333-555-7777', 'tom.brown@example.com', datetime.date(2025, 8, 7), 'Team Member', None, None, 1, datetime.datetime(2025, 8, 7, 15, 12, 25))]

In [71]:
%%sql
select * from audit;

 * mysql+pymysql://root:***@localhost:3306/
37 rows affected.

[(1, 'customers', '{"ID": 0, "city": "Kolkata", "name": "Riya Chatterjee", "gender": "female", "ph_num": "9812345001", "address": "32 Lake Road", "country": "India", "postal_code": "700029"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (2, 'customers', '{"ID": 0, "city": "Delhi", "name": "Sahil Malhotra", "gender": "male", "ph_num": "9911122233", "address": "7 Block D, Punjabi Bagh", "country": "India", "postal_code": "110026"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (3, 'customers', '{"ID": 0, "city": "Hyderabad", "name": "Kavya Reddy", "gender": "female", "ph_num": "9845123401", "address": "98 Road No. 10", "country": "India", "postal_code": "500034"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (4, 'customers', '{"ID": 0, "city": "Patna", "name": "Aditya Verma", "gender": "male", "ph_num": "9898989898", "address": "221 Rajiv Nagar", "country": "India", "postal_code": "800001"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (5, 'customers', '{"ID": 0, "city": "Mumbai", "name": "Neha Desai", "gender": "female", "ph_num": "9822054321", "address": "66 Shivaji Park", "country": "India", "postal_code": "400028"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (6, 'customers', '{"ID": 0, "city": "Kolkata", "name": "Manoj Kumar", "gender": "male", "ph_num": "9830012345", "address": "45 Vivekananda Street", "country": "India", "postal_code": "700019"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (7, 'customers', '{"ID": 0, "city": "Chennai", "name": "Tanvi Nair", "gender": "female", "ph_num": "9998800001", "address": "12 MG Layout", "country": "India", "postal_code": "600028"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (8, 'customers', '{"ID": 0, "city": "Ahmedabad", "name": "Arvind Gupta", "gender": "male", "ph_num": "9810001234", "address": "9 City Centre", "country": "India", "postal_code": "380015"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (9, 'customers', '{"ID": 0, "city": "Jalandhar", "name": "Nikita Sharma", "gender": "female", "ph_num": "9876543210", "address": "78 Model Town", "country": "India", "postal_code": "144003"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (10, 'customers', '{"ID": 0, "city": "Jaipur", "name": "Vikram Singh", "gender": "male", "ph_num": "9988776655", "address": "50 MI Road", "country": "India", "postal_code": "302001"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 8, 25)),
 (12, 'customers', '{"ID": 0, "city": "Patna", "name": "Neha Saxena", "gender": "female", "ph_num": "9991000010", "address": "2 Boring Road", "country": "India", "postal_code": "800001"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 33)),
 (13, 'customers', '{"ID": 0, "city": "Gurgaon", "name": "Varun Malik", "gender": "male", "ph_num": "9993008229", "address": "10 Sector 12", "country": "India", "postal_code": "122001"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 37)),
 (14, 'category', '{"id": 0, "desc": "Devices and gadgets like phones, laptops, etc.", "name": "Electronics"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 51)),
 (15, 'category', '{"id": 0, "desc": "Apparel and fashion items such as shirts, pants, etc.", "name": "Clothing"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 51)),
 (16, 'category', '{"id": 0, "desc": "Food items, vegetables, fruits, etc.", "name": "Groceries"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 51)),
 (17, 'category', '{"id": 0, "desc": "Playthings for children, games, and puzzles.", "name": "Toys"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 53)),
 (18, 'category', '{"id": 0, "desc": "Chairs, tables, beds, and other furniture items.", "name": "Furniture"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 10, 53)),
 (19, 'products', '{"id": 0, "name": "Smartphone", "category_id": 1, "description": "Latest model smartphone with advanced features"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11)),
 (20, 'products', '{"id": 0, "name": "T-shirt", "category_id": 2, "description": "Cotton t-shirt with modern design"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11)),
 (21, 'products', '{"id": 0, "name": "Apple", "category_id": 3, "description": "Fresh red apples, locally grown"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11)),
 (22, 'products', '{"id": 0, "name": "Laptop", "category_id": 1, "description": "High-performance laptop for gaming and work"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11)),
 (23, 'products', '{"id": 0, "name": "Jeans", "category_id": 2, "description": "Blue denim jeans, slim fit"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 2)),
 (24, 'inventory', '{"quantity": 100, "product_id": 1}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 7)),
 (25, 'inventory', '{"quantity": 200, "product_id": 2}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 7)),
 (26, 'inventory', '{"quantity": 500, "product_id": 3}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 7)),
 (27, 'inventory', '{"quantity": 50, "product_id": 4}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 12)),
 (28, 'inventory', '{"quantity": 150, "product_id": 5}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 12)),
 (29, 'price_history', '{"price": 599.99, "product": 1, "effective_date": "2025-01-01"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 41)),
 (30, 'price_history', '{"price": 19.99, "product": 2, "effective_date": "2025-02-01"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 41)),
 (31, 'price_history', '{"price": 1.99, "product": 3, "effective_date": "2025-03-01"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 41)),
 (32, 'price_history', '{"price": 1300.00, "product": 4, "effective_date": "2025-01-15"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 42)),
 (33, 'price_history', '{"price": 40.00, "product": 5, "effective_date": "2025-02-15"}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 11, 42)),
 (34, 'employees', '{"id": 0, "age": 45, "name": "John Doe", "role": "Manager", "email": "john.doe@example.com", "is_working": 1, "manager_id": null, "phone_number": "123-456-7890", "termination_date": null}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 12, 24)),
 (35, 'employees', '{"id": 0, "age": 30, "name": "Alice Smith", "role": "Team Member", "email": "alice.smith@example.com", "is_working": 1, "manager_id": 1, "phone_number": "987-654-3210", "termination_date": null}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 12, 24)),
 (36, 'employees', '{"id": 0, "age": 35, "name": "Bob Johnson", "role": "Team Member", "email": "bob.johnson@example.com", "is_working": 1, "manager_id": 1, "phone_number": "555-123-4567", "termination_date": null}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 12, 24)),
 (37, 'employees', '{"id": 0, "age": 28, "name": "Sarah White", "role": "Team Member", "email": "sarah.white@example.com", "is_working": 1, "manager_id": null, "phone_number": "444-987-6543", "termination_date": null}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 12, 25)),
 (38, 'employees', '{"id": 0, "age": 32, "name": "Tom Brown", "role": "Team Member", "email": "tom.brown@example.com", "is_working": 1, "manager_id": null, "phone_number": "333-555-7777", "termination_date": null}', None, 'insert', 'root@localhost', datetime.datetime(2025, 8, 7, 15, 12, 25))]

In [72]:
%%sql
-- Insert data directly into the cart table

-- Customer 1 adds 2 Smartphones (product_id = 1, seller_id = 1)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (1, 1, 1, 2, 2 * 599.99, 0);

-- Customer 2 adds 1 T-shirt (product_id = 2, seller_id = 2)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (2, 2, 2, 1, 1 * 19.99, 0);

-- Customer 1 adds 3 Apples (product_id = 3, seller_id = 1)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (3, 1, 1, 3, 3 * 1.99, 0);

-- Customer 3 adds 1 Laptop (product_id = 4, seller_id = 3)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (4, 3, 3, 1, 1 * 1299.99, 0);

-- Customer 2 adds 2 Jeans (product_id = 5, seller_id = 2)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (5, 2, 2, 2, 2 * 39.99, 0);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [73]:
%%sql
select * from cart;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 1, 1, 2, 1200, 0),
 (2, 2, 2, 1, 20, 0),
 (3, 1, 1, 3, 6, 0),
 (4, 3, 3, 1, 1300, 0),
 (5, 2, 2, 2, 80, 0)]

In [74]:
%%sql
select * from orderitems;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [75]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [76]:
%%sql
CALL insert_values_cart(1, 1, 1, 2, 1);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [77]:
%%sql
select * from cart;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[(2, 2, 2, 1, 20, 0), (4, 3, 3, 1, 1300, 0), (5, 2, 2, 2, 80, 0)]

In [78]:
%%sql
CALL insert_values_cart(1, 2, 1, 2, 1);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [79]:
%%sql
select * from orderitems;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 1, 1, 1, 1, 4, 1200),
 (2, 1, 3, 1, 1, 3, 6),
 (4, 2, 2, 2, 2, 1, 20),
 (5, 2, 5, 2, 2, 2, 80),
 (6, 2, 1, 2, 1, 2, 1200)]

In [80]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(1, 1, 7, 1206, datetime.datetime(2025, 8, 7, 15, 12, 51)),
 (2, 2, 5, 1300, datetime.datetime(2025, 8, 7, 15, 12, 59))]

In [82]:
%%sql
CALL copy_shipping_address(1,1);
SELECT * FROM shipping;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[(1, 1, None, 'pending', None, '32 Lake Road', 'Kolkata', 'West Bengal', '700029', 'India')]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql